# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

st = input("Введите целое беззнаковое число: ")
mx = 0
for i in st:
    if int(i) > mx:
        mx = int(i)

print("Максимальное число:",mx)


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

a = int(input("a="))
b = int(input("b="))

# вариант 1
a = a + b
b = a - b
a = a - b

print("swap: a =", a, " b =", b)

# вариант 2 через tuple
a,b = (b, a)

print("swap again: a =", a, " b =", b)


# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

a = int(input("a="))
b = int(input("b="))
c = int(input("c="))

import math

d = b ** 2 - 4 * a * c

if d > 0:
    x1 = (-b + math.sqrt(d)) / (2 * a)
    x2 = (-b - math.sqrt(d)) / (2 * a)
    print("уравнение имеет два различных вещественных корня x1=", x1, " x2=", x2)
elif d == 0:
    x = -b / (2 * a)
    print("оба корня вещественны и равны x=", x)
else:
    print("оба корня являются комплексными числами")
